ehughes/ESC-M4/CM4_TEST/PROJECTS/KEIL/INSTRUCTION_TEST/prj_xpresso54114/iar/support/LPC5411x.svd
			</registers>

		</peripheral>

		<peripheral>
			<name>DMA</name>
			<description>DMA controller</description>
			<groupName>DMA</groupName>
			<baseAddress>0x40082000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>DMA</name>
				<value>3</value>
			</interrupt>
			<registers>
				<register>
					<name>CTRL</name>
					<description>DMA control.</description>
					<addressOffset>0x000</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ENABLE</name>
							<description>DMA controller master enable.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. The DMA controller is disabled. This
										clears any triggers that were asserted at the point when
										disabled, but does not prevent re-triggering when the DMA
										controller is re-enabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. The DMA controller is
										enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:1]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>INTSTAT</name>
					<description>Interrupt status.</description>
					<addressOffset>0x004</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[0:0]</bitRange>

						</field>
						<field>
							<name>ACTIVEINT</name>
							<description>Summarizes whether any enabled interrupts (other than error
								interrupts) are pending.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NOT_PENDING</name>
									<description>Not pending. No enabled interrupts are
										pending.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PENDING</name>
									<description>Pending. At least one enabled interrupt is
										pending.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ACTIVEERRINT</name>
							<description>Summarizes whether any error interrupts are
								pending.</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NOT_PENDING</name>
									<description>Not pending. No error interrupts are
										pending.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PENDING</name>
									<description>Pending. At least one error interrupt is
										pending.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:3]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>SRAMBASE</name>
					<description>SRAM address of the channel configuration table.</description>
					<addressOffset>0x008</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[8:0]</bitRange>
						</field>
						<field>
							<name>OFFSET</name>
							<description>Address bits 31:9 of the beginning of the DMA descriptor
								table. For 18 channels, the table must begin on a 512 byte
								boundary.</description>
							<bitRange>[31:9]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>ENABLESET0</name>
					<description>Channel Enable read and Set for all DMA channels.</description>
					<addressOffset>0x020</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ENA</name>
							<description>Enable for DMA channels. Bit n enables or disables DMA
								channel n. 0 = disabled. 1 = enabled.</description>
							<bitRange>[21:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:22]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>ENABLECLR0</name>
					<description>Channel Enable Clear for all DMA channels.</description>
					<addressOffset>0x028</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>CLR</name>
							<description>Writing ones to this register clears the corresponding bits
								in ENABLESET0. Bit n clears the channel enable bit n.</description>
							<bitRange>[21:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:22]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>ACTIVE0</name>
					<description>Channel Active status for all DMA channels.</description>
					<addressOffset>0x030</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ACT</name>
							<description>Active flag for DMA channel n. Bit n corresponds to DMA
								channel n. 0 = not active. 1 = active.</description>
							<bitRange>[21:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:22]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>BUSY0</name>
					<description>Channel Busy status for all DMA channels.</description>
					<addressOffset>0x038</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>BSY</name>
							<description>Busy flag for DMA channel n. Bit n corresponds to DMA
								channel n. 0 = not busy. 1 = busy.</description>
							<bitRange>[21:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:22]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>ERRINT0</name>
					<description>Error Interrupt status for all DMA channels.</description>
					<addressOffset>0x040</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ERR</name>
							<description>Error Interrupt flag for DMA channel n. Bit n corresponds
								to DMA channel n. 0 = error interrupt is not active. 1 = error
								interrupt is active.</description>
							<bitRange>[21:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:22]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>INTENSET0</name>
					<description>Interrupt Enable read and Set for all DMA channels.</description>
					<addressOffset>0x048</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>INTEN</name>
							<description>Interrupt Enable read and set for DMA channel n. Bit n
								corresponds to DMA channel n. 0 = interrupt for DMA channel is
								disabled. 1 = interrupt for DMA channel is enabled.</description>
							<bitRange>[21:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:22]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>INTENCLR0</name>
					<description>Interrupt Enable Clear for all DMA channels.</description>
					<addressOffset>0x050</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>CLR</name>
							<description>Writing ones to this register clears corresponding bits in
								the INTENSET0. Bit n corresponds to DMA channel n.</description>
							<bitRange>[21:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:22]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>INTA0</name>
					<description>Interrupt A status for all DMA channels.</description>
					<addressOffset>0x058</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>IA</name>
							<description>Interrupt A status for DMA channel n. Bit n corresponds to
								DMA channel n. 0 = the DMA channel interrupt A is not active. 1 =
								the DMA channel interrupt A is active.</description>
							<bitRange>[21:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:22]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>INTB0</name>
					<description>Interrupt B status for all DMA channels.</description>
					<addressOffset>0x060</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>IB</name>
							<description>Interrupt B status for DMA channel n. Bit n corresponds to
								DMA channel n. 0 = the DMA channel interrupt B is not active. 1 =
								the DMA channel interrupt B is active.</description>
							<bitRange>[21:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:22]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>SETVALID0</name>
					<description>Set ValidPending control bits for all DMA channels.</description>
					<addressOffset>0x068</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>SV</name>
							<description>SETVALID control for DMA channel n. Bit n corresponds to
								DMA channel n. 0 = no effect. 1 = sets the VALIDPENDING control bit
								for DMA channel n.</description>
							<bitRange>[21:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:22]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>SETTRIG0</name>
					<description>Set Trigger control bits for all DMA channels.</description>
					<addressOffset>0x070</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>TRIG</name>
							<description>Set Trigger control bit for DMA channel 0. Bit n
								corresponds to DMA channel n. 0 = no effect. 1 = sets the TRIG bit
								for DMA channel n.</description>
							<bitRange>[21:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:22]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>ABORT0</name>
					<description>Channel Abort control for all DMA channels.</description>
					<addressOffset>0x078</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>ABORTCTRL</name>
							<description>Abort control for DMA channel 0. Bit n corresponds to DMA
								channel n. 0 = no effect. 1 = aborts DMA operations on channel
								n.</description>
							<bitRange>[21:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:22]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>22</dim>
					<dimIncrement>0x10</dimIncrement>
					<dimIndex>0-21</dimIndex>
					<name>CFG%s</name>
					<description>Configuration register for DMA channel 0.</description>
					<addressOffset>0x400</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>PERIPHREQEN</name>
							<description>Peripheral request Enable. If a DMA channel is used to
								perform a memory-to-memory move, any peripheral DMA request
								associated with that channel can be disabled to prevent any
								interaction between the peripheral and the DMA
								controller.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. Peripheral DMA requests are
										disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. Peripheral DMA requests are
										enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HWTRIGEN</name>
							<description>Hardware Triggering Enable for this channel.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. Hardware triggering is not
										used.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. Use hardware triggering.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[3:2]</bitRange>

