ehughes/ESC-M4/CM4_TEST/PROJECTS/KEIL/INSTRUCTION_TEST/prj_xpresso54114/iar/support/LPC5411x.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>SCT0</name>
			<description>State Configurable Timer/PWM 0 </description>
			<groupName>SCT0</groupName>
			<baseAddress>0x40085000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>SCT0</name>
				<value>16</value>
			</interrupt>
			<registers>
				<register>
					<name>CONFIG</name>
					<description>SCT configuration register</description>
					<addressOffset>0x000</addressOffset>
					<access>read-write</access>
					<resetValue>0x7E00</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>UNIFY</name>
							<description>SCT operation</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DUAL_COUNTER</name>
									<description>Dual counter. The SCT operates as two 16-bit
										counters named L and H.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>UNIFIED_COUNTER</name>
									<description>Unified counter. The SCT operates as a unified
										32-bit counter.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CLKMODE</name>
							<description>SCT clock mode</description>
							<bitRange>[2:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>SYSTEM_CLOCK</name>
									<description>System clock. The system clock clocks the SCT and
										prescalers.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRESCALED_SYSTEM_CLO</name>
									<description>Prescaled system clock. The SCT clock is the system
										clock, but the prescalers are enabled to count only when
										sampling of the input selected by the CKSEL field finds the
										selected edge. The minimum pulse width on the clock input is
										1 bus clock period. This mode is the high-performance
										sampled-clock mode.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SCT_INPUT</name>
									<description>SCT input. The input selected by CKSEL clocks the
										SCT and prescalers. The input is synchronized to the system
										clock and possibly inverted. The minimum pulse width on the
										clock input is 1 bus clock period. This mode is the
										low-power sampled-clock mode.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRESCALED_SCT_INPUT</name>
									<description>Prescaled SCT input. The SCT and prescalers are
										clocked by the input edge selected by the CKSEL field. In
										this mode, most of the SCT is clocked by the (selected
										polarity of the) input. The outputs are switched
										synchronously to the input clock. The input clock rate must
										be at least half the system clock rate and can be the same
										or faster than the system clock.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CKSEL</name>
							<description>SCT clock select</description>
							<bitRange>[6:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>INPUT_0_RISING_EDGES</name>
									<description>Input 0 rising edges.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_0_FALLING_EDGE</name>
									<description>Input 0 falling edges.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_1_RISING_EDGES</name>
									<description>Input 1 rising edges.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_1_FALLING_EDGE</name>
									<description>Input 1 falling edges.</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_2_RISING_EDGES</name>
									<description>Input 2 rising edges.</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_2_FALLING_EDGE</name>
									<description>Input 2 falling edges.</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_3_RISING_EDGES</name>
									<description>Input 3 rising edges.</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_3_FALLING_EDGE</name>
									<description>Input 3 falling edges.</description>
									<value>0x7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_4_RISING_EDGES</name>
									<description>Input 4 rising edges.</description>
									<value>0x8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_4_FALLING_EDGE</name>
									<description>Input 4 falling edges.</description>
									<value>0x9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_5_RISING_EDGES</name>
									<description>Input 5 rising edges.</description>
									<value>0xA</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_5_FALLING_EDGE</name>
									<description>Input 5 falling edges.</description>
									<value>0xB</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_6_RISING_EDGES</name>
									<description>Input 6 rising edges.</description>
									<value>0xC</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_6_FALLING_EDGE</name>
									<description>Input 6 falling edges.</description>
									<value>0xD</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_7_RISING_EDGES</name>
									<description>Input 7 rising edges.</description>
									<value>0xE</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_7_FALLING_EDGE</name>
									<description>Input 7 falling edges.</description>
									<value>0xF</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>NORELOAD_L</name>
							<description>A 1 in this bit prevents the lower match registers from
								being reloaded from their respective reload registers. Software can
								write to set or clear this bit at any time. This bit applies to both
								the higher and lower registers when the UNIFY bit is
								set.</description>
							<bitRange>[7:7]</bitRange>

