ehughes/ESC-M4/CM4_TEST/PROJECTS/KEIL/INSTRUCTION_TEST/prj_xpresso54114/iar/support/LPC5411x.svd
						</field>
						<field>
							<name>STOP_H</name>
							<description>When this bit is 1 and HALT is 0, the H counter does not
								run but I/O events related to the counter can occur. If such an
								event matches the mask in the Start register, this bit is cleared
								and counting resumes.</description>
							<bitRange>[17:17]</bitRange>

						</field>
						<field>
							<name>HALT_H</name>
							<description>When this bit is 1, the H counter does not run and no
								events can occur. A reset sets this bit. When the HALT_H bit is one,
								the STOP_H bit is cleared. In order to remove the halt condition and
								keep the SCT in the stop condition (not running), the halt and stop
								condition can be changed with one single write to this register.
								Once set, this bit can only be cleared by software to restore
								counter operation.</description>
							<bitRange>[18:18]</bitRange>

						</field>
						<field>
							<name>CLRCTR_H</name>
							<description>Writing a 1 to this bit clears the H counter. This bit
								always reads as 0.</description>
							<bitRange>[19:19]</bitRange>

						</field>
						<field>
							<name>BIDIR_H</name>
							<description>Direction select</description>
							<bitRange>[20:20]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>UNIDIRECTIONAL</name>
									<description>Unidirectional. The H counter counts up to its
										limit condition, then is cleared to zero.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BIDIRECTIONAL</name>
									<description>Bidirectional. The H counter counts up to its
										limit, then counts down to a limit condition or to
										0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PRE_H</name>
							<description>Specifies the factor by which the SCT clock is prescaled to
								produce the H counter clock. The counter clock is clocked at the
								rate of the SCT clock divided by PRELH+1. Clear the counter (by
								writing a 1 to the CLRCTR bit) whenever changing the PRE
								value.</description>
							<bitRange>[28:21]</bitRange>

						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:29]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>LIMIT</name>
					<description>SCT limit register</description>
					<addressOffset>0x008</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>LIMMSK_L</name>
							<description>If bit n is one, event n is used as a counter limit event
								for the L or unified counter (event 0 = bit 0, event 1 = bit 1, etc.
								The number of bits = number of events in this SCT.</description>
							<bitRange>[15:0]</bitRange>
						</field>
						<field>
							<name>LIMMSK_H</name>
							<description>If bit n is one, event n is used as a counter limit event
								for the H counter (event 0 = bit 16, event 1 = bit 17, etc. The
								number of bits = number of events in this SCT.</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>HALT</name>
					<description>SCT halt condition register</description>
					<addressOffset>0x00C</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>HALTMSK_L</name>
							<description>If bit n is one, event n sets the HALT_L bit in the CTRL
								register (event 0 = bit 0, event 1 = bit 1, etc. The number of bits
								= number of events in this SCT.</description>
							<bitRange>[15:0]</bitRange>
						</field>
						<field>
							<name>HALTMSK_H</name>
							<description>If bit n is one, event n sets the HALT_H bit in the CTRL
								register (event 0 = bit 16, event 1 = bit 17, etc. The number of
								bits = number of events in this SCT.</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>STOP</name>
					<description>SCT stop condition register</description>
					<addressOffset>0x010</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>STOPMSK_L</name>
							<description>If bit n is one, event n sets the STOP_L bit in the CTRL
								register (event 0 = bit 0, event 1 = bit 1, etc. The number of bits
								= number of events in this SCT.</description>
							<bitRange>[15:0]</bitRange>
						</field>
						<field>
							<name>STOPMSK_H</name>
							<description>If bit n is one, event n sets the STOP_H bit in the CTRL
								register (event 0 = bit 16, event 1 = bit 17, etc. The number of
								bits = number of events in this SCT.</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>START</name>
					<description>SCT start condition register</description>
					<addressOffset>0x014</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>STARTMSK_L</name>
							<description>If bit n is one, event n clears the STOP_L bit in the CTRL
								register (event 0 = bit 0, event 1 = bit 1, etc. The number of bits
								= number of events in this SCT.</description>
							<bitRange>[15:0]</bitRange>
						</field>
						<field>
							<name>STARTMSK_H</name>
							<description>If bit n is one, event n clears the STOP_H bit in the CTRL
								register (event 0 = bit 16, event 1 = bit 17, etc. The number of
								bits = number of events in this SCT.</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>COUNT</name>
					<description>SCT counter register</description>
					<addressOffset>0x040</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CTR_L</name>
							<description>When UNIFY = 0, read or write the 16-bit L counter value.
								When UNIFY = 1, read or write the lower 16 bits of the 32-bit
								unified counter.</description>
							<bitRange>[15:0]</bitRange>
						</field>
						<field>
							<name>CTR_H</name>
							<description>When UNIFY = 0, read or write the 16-bit H counter value.
								When UNIFY = 1, read or write the upper 16 bits of the 32-bit
								unified counter.</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>STATE</name>
					<description>SCT state register</description>
					<addressOffset>0x044</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>STATE_L</name>
							<description>State variable.</description>
							<bitRange>[4:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[15:5]</bitRange>
						</field>
						<field>
							<name>STATE_H</name>
							<description>State variable.</description>
							<bitRange>[20:16]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:21]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>INPUT</name>
					<description>SCT input register</description>
					<addressOffset>0x048</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>AIN0</name>
							<description>Input 0 state.Direct read.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>AIN1</name>
							<description>Input 1 state. Direct read.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>AIN2</name>
							<description>Input 2 state. Direct read.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>AIN3</name>
							<description>Input 3 state. Direct read.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>AIN4</name>
							<description>Input 4 state. Direct read.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>AIN5</name>
							<description>Input 5 state. Direct read.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[15:6]</bitRange>
						</field>
						<field>
							<name>SIN0</name>
							<description>Input 0 state.</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>SIN1</name>
							<description>Input 1 state.</description>
							<bitRange>[17:17]</bitRange>
						</field>
						<field>
							<name>SIN2</name>
							<description>Input 2 state.</description>
							<bitRange>[18:18]</bitRange>
						</field>
						<field>
							<name>SIN3</name>
							<description>Input 3 state.</description>
							<bitRange>[19:19]</bitRange>
						</field>
						<field>
							<name>SIN4</name>
							<description>Input 4 state.</description>
							<bitRange>[20:20]</bitRange>
						</field>
						<field>
							<name>SIN5</name>
							<description>Input 5 state.</description>
							<bitRange>[21:21]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:22]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>REGMODE</name>
					<description>SCT match/capture registers mode register</description>
					<addressOffset>0x04C</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>REGMOD_L</name>
							<description>Each bit controls one pair of match/capture registers
								(register 0 = bit 0, register 1 = bit 1,..., etc. 0 = registers
								operate as match registers. 1 = registers operate as capture
								registers.</description>
							<bitRange>[15:0]</bitRange>
						</field>
						<field>
							<name>REGMOD_H</name>
							<description>Each bit controls one pair of match/capture registers
								(register 0 = bit 16, register 1 = bit 17, etc. 0 = registers
								operate as match registers. 1 = registers operate as capture
								registers.</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>OUTPUT</name>
					<description>SCT output register</description>
					<addressOffset>0x050</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>OUT</name>
							<description>Writing a 1 to bit n makes the corresponding output HIGH. 0
								makes the corresponding output LOW (output 0 = bit 0, output 1 = bit
								1, etc.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>OUTPUTDIRCTRL</name>
					<description>SCT output counter direction control register</description>
					<addressOffset>0x054</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SETCLR0</name>
							<description>Set/clear operation on output 0. Value 0x3 is reserved. Do
								not program this value.</description>
							<bitRange>[1:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>INDEPENDENT</name>
									<description>Independent. Set and clear do not depend on any
										counter.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>L_REVERSED</name>
									<description>L-Reversed. Set and clear are reversed when counter
										L or the unified counter is counting down.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>H_REVERSED</name>
									<description>H-Reversed. Set and clear are reversed when counter
										H is counting down. Do not use if UNIFY = 1.</description>
									<value>0x2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SETCLR1</name>
							<description>Set/clear operation on output 1. See description of bit
								0.</description>
							<bitRange>[3:2]</bitRange>

