ehughes/ESC-M4/CM4_TEST/PROJECTS/KEIL/INSTRUCTION_TEST/prj_xpresso54114/iar/support/LPC5411x.svd
						</field>
						<field>
							<name>SETCLR2</name>
							<description>Set/clear operation on output 2. See description of bit
								0.</description>
							<bitRange>[5:4]</bitRange>

						</field>
						<field>
							<name>SETCLR3</name>
							<description>Set/clear operation on output 3. See description of bit
								0.</description>
							<bitRange>[7:6]</bitRange>

						</field>
						<field>
							<name>SETCLR4</name>
							<description>Set/clear operation on output 4. See description of bit
								0.</description>
							<bitRange>[9:8]</bitRange>

						</field>
						<field>
							<name>SETCLR5</name>
							<description>Set/clear operation on output 5. See description of bit
								0.</description>
							<bitRange>[11:10]</bitRange>

						</field>
						<field>
							<name>SETCLR6</name>
							<description>Set/clear operation on output 6. See description of bit
								0.</description>
							<bitRange>[13:12]</bitRange>

						</field>
						<field>
							<name>SETCLR7</name>
							<description>Set/clear operation on output 7. See description of bit
								0.</description>
							<bitRange>[15:14]</bitRange>

						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:26]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>RES</name>
					<description>SCT conflict resolution register</description>
					<addressOffset>0x058</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>O0RES</name>
							<description>Effect of simultaneous set and clear on output
								0.</description>
							<bitRange>[1:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_CHANGE</name>
									<description>No change.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Set. Set output (or clear based on the SETCLR0
										field).</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR</name>
									<description>Clear. Clear output (or set based on the SETCLR0
										field).</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TOGGLE_OUTPUT</name>
									<description>Toggle output.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>

						</field>

						<field>
							<name>O1RES</name>
							<description>Effect of simultaneous set and clear on output
								1.</description>
							<bitRange>[3:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_CHANGE</name>
									<description>No change.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Set. Set output (or clear based on the SETCLR1
										field).</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR</name>
									<description>Clear. Clear output (or set based on the SETCLR1
										field).</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TOGGLE_OUTPUT</name>
									<description>Toggle output.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>O2RES</name>
							<description>Effect of simultaneous set and clear on output
								2.</description>
							<bitRange>[5:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_CHANGE</name>
									<description>No change.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Set. Set output (or clear based on the SETCLR2
										field).</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR</name>
									<description>Clear. Clear output (or set based on the SETCLR2
										field).</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TOGGLE_OUTPUT</name>
									<description>Toggle output.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>O3RES</name>
							<description>Effect of simultaneous set and clear on output
								3.</description>
							<bitRange>[7:6]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_CHANGE</name>
									<description>No change.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Set. Set output (or clear based on the SETCLR3
										field).</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR</name>
									<description>Clear. Clear output (or set based on the SETCLR3
										field).</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TOGGLE_OUTPUT</name>
									<description>Toggle output.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>O4RES</name>
							<description>Effect of simultaneous set and clear on output
								4.</description>
							<bitRange>[9:8]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_CHANGE</name>
									<description>No change.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Set. Set output (or clear based on the SETCLR4
										field).</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR</name>
									<description>Clear. Clear output (or set based on the SETCLR4
										field).</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TOGGLE_OUTPUT</name>
									<description>Toggle output.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>O5RES</name>
							<description>Effect of simultaneous set and clear on output
								5.</description>
							<bitRange>[11:10]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_CHANGE</name>
									<description>No change.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Set. Set output (or clear based on the SETCLR5
										field).</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR</name>
									<description>Clear. Clear output (or set based on the SETCLR5
										field).</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TOGGLE_OUTPUT</name>
									<description>Toggle output.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>O6RES</name>
							<description>Effect of simultaneous set and clear on output
								6.</description>
							<bitRange>[13:12]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_CHANGE</name>
									<description>No change.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Set. Set output (or clear based on the SETCLR6
										field).</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR</name>
									<description>Clear. Clear output (or set based on the SETCLR6
										field).</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TOGGLE_OUTPUT</name>
									<description>Toggle output.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>O7RES</name>
							<description>Effect of simultaneous set and clear on output
								7.</description>
							<bitRange>[15:14]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_CHANGE</name>
									<description>No change.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Set. Set output (or clear based on the SETCLR7
										field).</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR</name>
									<description>Clear. Clear output (or set based on the SETCLR7
										field).</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TOGGLE_OUTPUT</name>
									<description>Toggle output.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:16]</bitRange>

