ehughes/ESC-M4/CM4_TEST/PROJECTS/KEIL/INSTRUCTION_TEST/prj_xpresso54114/iar/support/LPC5411x.svd
						</field>
					</fields>
				</register>
				<register>
					<name>DMAREQ0</name>
					<description>SCT DMA request 0 register</description>
					<addressOffset>0x05C</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DEV_0</name>
							<description>If bit n is one, event n sets DMA request 0 (event 0 = bit
								0, event 1 = bit 1, etc. The number of bits = number of events in
								this SCT.</description>
							<bitRange>[15:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[29:16]</bitRange>
						</field>
						<field>
							<name>DRL0</name>
							<description>A 1 in this bit makes the SCT set DMA request 0 when it
								loads the Match_L/Unified registers from the Reload_L/Unified
								registers.</description>
							<bitRange>[30:30]</bitRange>
						</field>
						<field>
							<name>DRQ0</name>
							<description>This read-only bit indicates the state of DMA Request
								0</description>
							<bitRange>[31:31]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>DMAREQ1</name>
					<description>SCT DMA request 1 register</description>
					<addressOffset>0x060</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DEV_1</name>
							<description>If bit n is one, event n sets DMA request 1 (event 0 = bit
								0, event 1 = bit 1, etc. The number of bits = number of events in
								this SCT.</description>
							<bitRange>[15:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[29:16]</bitRange>
						</field>
						<field>
							<name>DRL1</name>
							<description>A 1 in this bit makes the SCT set DMA request 1 when it
								loads the Match L/Unified registers from the Reload L/Unified
								registers.</description>
							<bitRange>[30:30]</bitRange>
						</field>
						<field>
							<name>DRQ1</name>
							<description>This read-only bit indicates the state of DMA Request
								1.</description>
							<bitRange>[31:31]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>EVEN</name>
					<description>SCT event enable register</description>
					<addressOffset>0x0F0</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>IEN</name>
							<description>The SCT requests interrupt when bit n of this register and
								the event flag register are both one (event 0 = bit 0, event 1 = bit
								1, etc.</description>
							<bitRange>[15:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>EVFLAG</name>
					<description>SCT event flag register</description>
					<addressOffset>0x0F4</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FLAG</name>
							<description>Bit n is one if event n has occurred since reset or a 1 was
								last written to this bit (event 0 = bit 0, event 1 = bit 1,etc. The
								number of bits = number of events in this SCT.</description>
							<bitRange>[15:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CONEN</name>
					<description>SCT conflict enable register</description>
					<addressOffset>0x0F8</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>NCEN</name>
							<description>The SCT requests an interrupt when bit n of this register
								and the SCT conflict flag register are both one (output 0 = bit 0,
								output 1 = bit 1, etc.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:10]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CONFLAG</name>
					<description>SCT conflict flag register</description>
					<addressOffset>0x0FC</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>NCFLAG</name>
							<description>Bit n is one if a no-change conflict event occurred on
								output n since reset or a 1 was last written to this bit (output 0 =
								bit 0, output 1 = bit 1, etc.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[29:10]</bitRange>
						</field>
						<field>
							<name>BUSERRL</name>
							<description>The most recent bus error from this SCT involved writing
								CTR L/Unified, STATE L/Unified, MATCH L/Unified, or the Output
								register when the L/U counter was not halted. A word write to
								certain L and H registers can be half successful and half
								unsuccessful.</description>
							<bitRange>[30:30]</bitRange>
						</field>
						<field>
							<name>BUSERRH</name>
							<description>The most recent bus error from this SCT involved writing
								CTR H, STATE H, MATCH H, or the Output register when the H counter
								was not halted.</description>
							<bitRange>[31:31]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>13</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-12</dimIndex>
					<name>MATCH%s</name>
					<description>SCT match value register of match channels 0 to 12; REGMOD0 to
						REGMODE12 = 0</description>
					<addressOffset>0x100</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MATCHn_L</name>
							<description>When UNIFY = 0, read or write the 16-bit value to be
								compared to the L counter. When UNIFY = 1, read or write the lower
								16 bits of the 32-bit value to be compared to the unified
								counter.</description>
							<bitRange>[15:0]</bitRange>
						</field>
						<field>
							<name>MATCHn_H</name>
							<description>When UNIFY = 0, read or write the 16-bit value to be
								compared to the H counter. When UNIFY = 1, read or write the upper
								16 bits of the 32-bit value to be compared to the unified
								counter.</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>13</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-12</dimIndex>
					<name>CAP%s</name>
					<description>SCT capture register of capture channel 0 to 12; REGMOD0 to
						REGMODE12 = 1</description>
					<alternateRegister>MATCH%s</alternateRegister>
					<addressOffset>0x100</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CAPn_L</name>
							<description>When UNIFY = 0, read the 16-bit counter value at which this
								register was last captured. When UNIFY = 1, read the lower 16 bits
								of the 32-bit value at which this register was last
								captured.</description>
							<bitRange>[15:0]</bitRange>
						</field>
						<field>
							<name>CAPn_H</name>
							<description>When UNIFY = 0, read the 16-bit counter value at which this
								register was last captured. When UNIFY = 1, read the upper 16 bits
								of the 32-bit value at which this register was last
								captured.</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>13</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-12</dimIndex>
					<name>MATCHREL%s</name>
					<description>SCT match reload value register 0 to 12; REGMOD0 = 0 to REGMODE12 =
						0</description>
					<addressOffset>0x200</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RELOADn_L</name>
							<description>When UNIFY = 0, read or write the 16-bit value to be loaded
								into the MATCHn_L register. When UNIFY = 1, read or write the lower
								16 bits of the 32-bit value to be loaded into the MATCHn
								register.</description>
							<bitRange>[15:0]</bitRange>
						</field>
						<field>
							<name>RELOADn_H</name>
							<description>When UNIFY = 0, read or write the 16-bit to be loaded into
								the MATCHn_H register. When UNIFY = 1, read or write the upper 16
								bits of the 32-bit value to be loaded into the MATCHn
								register.</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>13</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-12</dimIndex>
					<name>CAPCTRL%s</name>
					<description>SCT capture control register 0 to 12; REGMOD0 = 1 to REGMODE12 =
						1</description>
					<alternateRegister>MATCHREL%s</alternateRegister>
					<addressOffset>0x200</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CAPCONn_L</name>
							<description>If bit m is one, event m causes the CAPn_L (UNIFY = 0) or
								the CAPn (UNIFY = 1) register to be loaded (event 0 = bit 0, event 1
								= bit 1, etc. The number of bits = number of events in this
								SCT.</description>
							<bitRange>[15:0]</bitRange>
						</field>
						<field>
							<name>CAPCONn_H</name>
							<description>If bit m is one, event m causes the CAPn_H (UNIFY = 0)
								register to be loaded (event 0 = bit 16, event 1 = bit 17, etc. The
								number of bits = number of events in this SCT.</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>13</dim>
					<dimIncrement>0x8</dimIncrement>
					<dimIndex>0-12</dimIndex>
					<name>EV%s_STATE</name>
					<description>SCT event state register 0</description>
					<addressOffset>0x300</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>STATEMSKn</name>
							<description>If bit m is one, event n happens in state m of the counter
								selected by the HEVENT bit (m = state number; state 0 = bit 0, state
								1= bit 1, etc. The number of bits = number of events in this
								SCT.</description>
							<bitRange>[12:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>13</dim>
					<dimIncrement>0x8</dimIncrement>
					<dimIndex>0-12</dimIndex>
					<name>EV%s_CTRL</name>
					<description>SCT event control register 0</description>
					<addressOffset>0x304</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MATCHSEL</name>
							<description>Selects the Match register associated with this event (if
								any). A match can occur only when the counter selected by the HEVENT
								bit is running.</description>
							<bitRange>[3:0]</bitRange>

