ehughes/ESC-M4/CM4_TEST/PROJECTS/KEIL/INSTRUCTION_TEST/prj_xpresso54114/iar/support/LPC5411x.svd
						</field>
						<field>
							<name>ASYNMODE</name>
							<description>Select clock mode.</description>
							<bitRange>[8:8]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>SYNCHRONOUS_MODE</name>
									<description>Synchronous mode. The ADC clock is derived from the
										system clock based on the divide value selected in the
										CLKDIV field. The ADC clock will be started in a controlled
										fashion in response to a trigger to eliminate any
										uncertainty in the launching of an ADC conversion in
										response to any synchronous (on-chip) trigger. In
										Synchronous mode with the SYNCBYPASS bit (in a sequence
										control register) set, sampling of the ADC input and start
										of conversion will initiate 2 system clocks after the
										leading edge of a (synchronous) trigger pulse.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ASYNCHRONOUS_MODE</name>
									<description>Asynchronous mode. The ADC clock is based on the
										output of the ADC clock divider ADCCLKSEL in the SYSCON
										block.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESOL</name>
							<description>The number of bits of ADC resolution. Accuracy can be
								reduced to achieve higher conversion rates. A single conversion
								requires the selected number of bits of resolution plus 3 ADC
								clocks. This field must only be altered when the ADC is fully idle.
								Changing it during any kind of ADC operation may have unpredictable
								results. ADC clock frequencies for various resolutions must not
								exceed: - 5x the system clock rate for 12-bit resolution - 4.3x the
								system clock rate for 10-bit resolution - 3.6x the system clock for
								8-bit resolution - 3x the bus clock rate for 6-bit
								resolution</description>
							<bitRange>[10:9]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>6_BIT_RESOLUTION</name>
									<description>6-bit resolution. An ADC conversion requires 9 ADC
										clocks, plus any clocks specified by the TSAMP
										field.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8_BIT_RESOLUTION</name>
									<description>8-bit resolution. An ADC conversion requires 11 ADC
										clocks, plus any clocks specified by the TSAMP
										field.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>10_BIT_RESOLUTION</name>
									<description>10-bit resolution. An ADC conversion requires 13
										ADC clocks, plus any clocks specified by the TSAMP
										field.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>12_BIT_RESOLUTION</name>
									<description>12-bit resolution. An ADC conversion requires 15
										ADC clocks, plus any clocks specified by the TSAMP
										field.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BYPASSCAL</name>
							<description>Bypass Calibration. This bit may be set to avoid the need
								to calibrate if offset error is not a concern in the
								application.</description>
							<bitRange>[11:11]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>CALIBRATE</name>
									<description>Calibrate. The stored calibration value will be
										applied to the ADC during conversions to compensated for
										offset error. A calibration cycle must be performed each
										time the chip is powered-up. Re-calibration may be warranted
										periodically - especially if operating conditions have
										changed.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BYPASS_CALIBRATION</name>
									<description>Bypass calibration. Calibration is not utilized.
										Less time is required when enabling the ADC - particularly
										following chip power-up. Attempts to launch a calibration
										cycle are blocked when this bit is set.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TSAMP</name>
							<description>Sample Time. The default sampling period (TSAMP = 000) at
								the start of each conversion is 2.5 ADC clock periods. Depending on
								a variety of factors, including operating conditions and the output
								impedance of the analog source, longer sampling times may be
								required. The TSAMP field specifies the number of additional ADC
								clock cycles, from zero to seven, by which the sample period will be
								extended. The total conversion time will increase by the same number
								of clocks. 000 - The sample period will be the default 2.5 ADC
								clocks. A complete conversion with 12-bits of accuracy will require
								15 clocks. 001- The sample period will be extended by one ADC clock
								to a total of 3.5 clock periods. A complete 12-bit conversion will
								require 16 clocks. 010 - The sample period will be extended by two
								clocks to 4.5 ADC clock cycles. A complete 12-bit conversion will
								require 17 ADC clocks. : 111 - The sample period will be extended by
								two clocks to 9.5 ADC clock cycles. A complete 12-bit conversion
								will require 22 ADC clocks.</description>
							<bitRange>[14:12]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>SEQA_CTRL</name>
					<description>ADC Conversion Sequence-A control Register: Controls triggering and
						channel selection for conversion sequence-A. Also specifies interrupt mode
						for sequence-A.</description>
					<addressOffset>0x008</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CHANNELS</name>
							<description>Selects which one or more of the ADC channels will be
								sampled and converted when this sequence is launched. A 1 in any bit
								of this field will cause the corresponding channel to be included in
								the conversion sequence, where bit 0 corresponds to channel 0, bit 1
								to channel 1 and so forth. When this conversion sequence is
								triggered, either by a hardware trigger or via software command, ADC
								conversions will be performed on each enabled channel, in sequence,
								beginning with the lowest-ordered channel. This field can ONLY be
								changed while the SEQA_ENA bit (bit 31) is LOW. It is allowed to
								change this field and set bit 31 in the same write.</description>
							<bitRange>[11:0]</bitRange>

