ehughes/ESC-M4/CM4_TEST/PROJECTS/KEIL/INSTRUCTION_TEST/prj_xpresso54114/iar/support/LPC5411x.svd
				<register>
					<name>THR0_HIGH</name>
					<description>ADC High Compare Threshold Register 0: Contains the upper threshold
						level for automatic threshold comparison for any channels linked to
						threshold pair 0.</description>
					<addressOffset>0x058</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[3:0]</bitRange>
						</field>
						<field>
							<name>THRHIGH</name>
							<description>High threshold value against which ADC results will be
								compared</description>
							<bitRange>[15:4]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>THR1_HIGH</name>
					<description>ADC High Compare Threshold Register 1: Contains the upper threshold
						level for automatic threshold comparison for any channels linked to
						threshold pair 1.</description>
					<addressOffset>0x05C</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[3:0]</bitRange>
						</field>
						<field>
							<name>THRHIGH</name>
							<description>High threshold value against which ADC results will be
								compared</description>
							<bitRange>[15:4]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CHAN_THRSEL</name>
					<description>ADC Channel-Threshold Select Register. Specifies which set of
						threshold compare registers are to be used for each channel</description>
					<addressOffset>0x060</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CH0_THRSEL</name>
							<description>Threshold select for channel 0.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>THRESHOLD0</name>
									<description>Threshold 0. Results for this channel will be
										compared against the threshold levels indicated in the
										THR0_LOW and THR0_HIGH registers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>THRESHOLD1</name>
									<description>Threshold 1. Results for this channel will be
										compared against the threshold levels indicated in the
										THR1_LOW and THR1_HIGH registers.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH1_THRSEL</name>
							<description>Threshold select for channel 1. See description for channel
								0.</description>
							<bitRange>[1:1]</bitRange>

						</field>
						<field>
							<name>CH2_THRSEL</name>
							<description>Threshold select for channel 2. See description for channel
								0.</description>
							<bitRange>[2:2]</bitRange>

						</field>
						<field>
							<name>CH3_THRSEL</name>
							<description>Threshold select for channel 3. See description for channel
								0.</description>
							<bitRange>[3:3]</bitRange>

						</field>
						<field>
							<name>CH4_THRSEL</name>
							<description>Threshold select for channel 4. See description for channel
								0.</description>
							<bitRange>[4:4]</bitRange>

						</field>
						<field>
							<name>CH5_THRSEL</name>
							<description>Threshold select for channel 5. See description for channel
								0.</description>
							<bitRange>[5:5]</bitRange>

						</field>
						<field>
							<name>CH6_THRSEL</name>
							<description>Threshold select for channel 6. See description for channel
								0.</description>
							<bitRange>[6:6]</bitRange>

						</field>
						<field>
							<name>CH7_THRSEL</name>
							<description>Threshold select for channel 7. See description for channel
								0.</description>
							<bitRange>[7:7]</bitRange>

						</field>
						<field>
							<name>CH8_THRSEL</name>
							<description>Threshold select for channel 8. See description for channel
								0.</description>
							<bitRange>[8:8]</bitRange>

						</field>
						<field>
							<name>CH9_THRSEL</name>
							<description>Threshold select for channel 9. See description for channel
								0.</description>
							<bitRange>[9:9]</bitRange>

						</field>
						<field>
							<name>CH10_THRSEL</name>
							<description>Threshold select for channel 10. See description for
								channel 0.</description>
							<bitRange>[10:10]</bitRange>

						</field>
						<field>
							<name>CH11_THRSEL</name>
							<description>Threshold select for channel 11. See description for
								channel 0.</description>
							<bitRange>[11:11]</bitRange>

						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:12]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>INTEN</name>
					<description>ADC Interrupt Enable Register. This register contains enable bits
						that enable the sequence-A, sequence-B, threshold compare and data overrun
						interrupts to be generated.</description>
					<addressOffset>0x064</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SEQA_INTEN</name>
							<description>Sequence A interrupt enable.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. The sequence A interrupt/DMA trigger is
										disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. The sequence A interrupt/DMA trigger is
										enabled and will be asserted either upon completion of each
										individual conversion performed as part of sequence A, or
										upon completion of the entire A sequence of conversions,
										depending on the MODE bit in the SEQA_CTRL
										register.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SEQB_INTEN</name>
							<description>Sequence B interrupt enable.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. The sequence B interrupt/DMA trigger is
										disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. The sequence B interrupt/DMA trigger is
										enabled and will be asserted either upon completion of each
										individual conversion performed as part of sequence B, or
										upon completion of the entire B sequence of conversions,
										depending on the MODE bit in the SEQB_CTRL
										register.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OVR_INTEN</name>
							<description>Overrun interrupt enable.</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. The overrun interrupt is
										disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. The overrun interrupt is enabled.
										Detection of an overrun condition on any of the 12 channel
										data registers will cause an overrun interrupt/DMA trigger.
										In addition, if the MODE bit for a particular sequence is 0,
										then an overrun in the global data register for that
										sequence will also cause this interrupt/DMA trigger to be
										asserted.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADCMPINTEN0</name>
							<description>Threshold comparison interrupt enable for channel
								0.</description>
							<bitRange>[4:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OUTSIDE_THRESHOLD</name>
									<description>Outside threshold.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CROSSING_THRESHOLD</name>
									<description>Crossing threshold.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>Reserved</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADCMPINTEN1</name>
							<description>Channel 1 threshold comparison interrupt enable. See
								description for channel 0.</description>
							<bitRange>[6:5]</bitRange>

