ehughes/ESC-M4/CM4_TEST/PROJECTS/KEIL/INSTRUCTION_TEST/prj_xpresso54114/iar/support/LPC5411x.svd
						</field>
						<field>
							<name>ADCMPINTEN2</name>
							<description>Channel 2 threshold comparison interrupt enable. See
								description for channel 0.</description>
							<bitRange>[8:7]</bitRange>

						</field>
						<field>
							<name>ADCMPINTEN3</name>
							<description>Channel 3 threshold comparison interrupt enable. See
								description for channel 0.</description>
							<bitRange>[10:9]</bitRange>

						</field>
						<field>
							<name>ADCMPINTEN4</name>
							<description>Channel 4 threshold comparison interrupt enable. See
								description for channel 0.</description>
							<bitRange>[12:11]</bitRange>

						</field>
						<field>
							<name>ADCMPINTEN5</name>
							<description>Channel 5 threshold comparison interrupt enable. See
								description for channel 0.</description>
							<bitRange>[14:13]</bitRange>

						</field>
						<field>
							<name>ADCMPINTEN6</name>
							<description>Channel 6 threshold comparison interrupt enable. See
								description for channel 0.</description>
							<bitRange>[16:15]</bitRange>

						</field>
						<field>
							<name>ADCMPINTEN7</name>
							<description>Channel 7 threshold comparison interrupt enable. See
								description for channel 0.</description>
							<bitRange>[18:17]</bitRange>

						</field>
						<field>
							<name>ADCMPINTEN8</name>
							<description>Channel 8 threshold comparison interrupt enable. See
								description for channel 0.</description>
							<bitRange>[20:19]</bitRange>

						</field>
						<field>
							<name>ADCMPINTEN9</name>
							<description>Channel 9 threshold comparison interrupt enable. See
								description for channel 0.</description>
							<bitRange>[22:21]</bitRange>

						</field>
						<field>
							<name>ADCMPINTEN10</name>
							<description>Channel 10 threshold comparison interrupt enable. See
								description for channel 0.</description>
							<bitRange>[24:23]</bitRange>

						</field>
						<field>
							<name>ADCMPINTEN11</name>
							<description>Channel 21 threshold comparison interrupt enable. See
								description for channel 0.</description>
							<bitRange>[26:25]</bitRange>

						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:27]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>FLAGS</name>
					<description>ADC Flags Register. Contains the four interrupt/DMA trigger flags
						and the individual component overrun and threshold-compare flags. (The
						overrun bits replicate information stored in the result
						registers).</description>
					<addressOffset>0x068</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>THCMP0</name>
							<description>Threshold comparison event on Channel 0. Set to 1 upon
								either an out-of-range result or a threshold-crossing result if
								enabled to do so in the INTEN register. This bit is cleared by
								writing a 1.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>THCMP1</name>
							<description>Threshold comparison event on Channel 1. See description
								for channel 0.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>THCMP2</name>
							<description>Threshold comparison event on Channel 2. See description
								for channel 0.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>THCMP3</name>
							<description>Threshold comparison event on Channel 3. See description
								for channel 0.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>THCMP4</name>
							<description>Threshold comparison event on Channel 4. See description
								for channel 0.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>THCMP5</name>
							<description>Threshold comparison event on Channel 5. See description
								for channel 0.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>THCMP6</name>
							<description>Threshold comparison event on Channel 6. See description
								for channel 0.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>THCMP7</name>
							<description>Threshold comparison event on Channel 7. See description
								for channel 0.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>THCMP8</name>
							<description>Threshold comparison event on Channel 8. See description
								for channel 0.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>THCMP9</name>
							<description>Threshold comparison event on Channel 9. See description
								for channel 0.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>THCMP10</name>
							<description>Threshold comparison event on Channel 10. See description
								for channel 0.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>THCMP11</name>
							<description>Threshold comparison event on Channel 11. See description
								for channel 0.</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>OVERRUN0</name>
							<description>Mirrors the OVERRRUN status flag from the result register
								for ADC channel 0</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>OVERRUN1</name>
							<description>Mirrors the OVERRRUN status flag from the result register
								for ADC channel 1</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>OVERRUN2</name>
							<description>Mirrors the OVERRRUN status flag from the result register
								for ADC channel 2</description>
							<bitRange>[14:14]</bitRange>
						</field>
						<field>
							<name>OVERRUN3</name>
							<description>Mirrors the OVERRRUN status flag from the result register
								for ADC channel 3</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>OVERRUN4</name>
							<description>Mirrors the OVERRRUN status flag from the result register
								for ADC channel 4</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>OVERRUN5</name>
							<description>Mirrors the OVERRRUN status flag from the result register
								for ADC channel 5</description>
							<bitRange>[17:17]</bitRange>
						</field>
						<field>
							<name>OVERRUN6</name>
							<description>Mirrors the OVERRRUN status flag from the result register
								for ADC channel 6</description>
							<bitRange>[18:18]</bitRange>
						</field>
						<field>
							<name>OVERRUN7</name>
							<description>Mirrors the OVERRRUN status flag from the result register
								for ADC channel 7</description>
							<bitRange>[19:19]</bitRange>
						</field>
						<field>
							<name>OVERRUN8</name>
							<description>Mirrors the OVERRRUN status flag from the result register
								for ADC channel 8</description>
							<bitRange>[20:20]</bitRange>
						</field>
						<field>
							<name>OVERRUN9</name>
							<description>Mirrors the OVERRRUN status flag from the result register
								for ADC channel 9</description>
							<bitRange>[21:21]</bitRange>
						</field>
						<field>
							<name>OVERRUN10</name>
							<description>Mirrors the OVERRRUN status flag from the result register
								for ADC channel 10</description>
							<bitRange>[22:22]</bitRange>
						</field>
						<field>
							<name>OVERRUN11</name>
							<description>Mirrors the OVERRRUN status flag from the result register
								for ADC channel 11</description>
							<bitRange>[23:23]</bitRange>
						</field>
						<field>
							<name>SEQA_OVR</name>
							<description>Mirrors the global OVERRUN status flag in the SEQA_GDAT
								register</description>
							<bitRange>[24:24]</bitRange>
						</field>
						<field>
							<name>SEQB_OVR</name>
							<description>Mirrors the global OVERRUN status flag in the SEQB_GDAT
								register</description>
							<bitRange>[25:25]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[27:26]</bitRange>
						</field>
						<field>
							<name>SEQA_INT</name>
							<description>Sequence A interrupt/DMA trigger. If the MODE bit in the
								SEQA_CTRL register is 0, this flag will mirror the DATAVALID bit in
								the sequence A global data register (SEQA_GDAT), which is set at the
								end of every ADC conversion performed as part of sequence A. It will
								be cleared automatically when the SEQA_GDAT register is read. If the
								MODE bit in the SEQA_CTRL register is 1, this flag will be set upon
								completion of an entire A sequence. In this case it must be cleared
								by writing a 1 to this SEQA_INT bit. This interrupt must be enabled
								in the INTEN register.</description>
							<bitRange>[28:28]</bitRange>
						</field>
						<field>
							<name>SEQB_INT</name>
							<description>Sequence A interrupt/DMA trigger. If the MODE bit in the
								SEQB_CTRL register is 0, this flag will mirror the DATAVALID bit in
								the sequence A global data register (SEQB_GDAT), which is set at the
								end of every ADC conversion performed as part of sequence B. It will
								be cleared automatically when the SEQB_GDAT register is read. If the
								MODE bit in the SEQB_CTRL register is 1, this flag will be set upon
								completion of an entire B sequence. In this case it must be cleared
								by writing a 1 to this SEQB_INT bit. This interrupt must be enabled
								in the INTEN register.</description>
							<bitRange>[29:29]</bitRange>
						</field>
						<field>
							<name>THCMP_INT</name>
							<description>Threshold Comparison Interrupt. This bit will be set if any
								of the THCMP flags in the lower bits of this register are set to 1
								(due to an enabled out-of-range or threshold-crossing event on any
								channel). Each type of threshold comparison interrupt on each
								channel must be individually enabled in the INTEN register to cause
								this interrupt. This bit will be cleared when all of the individual
								threshold flags are cleared via writing 1s to those
								bits.</description>
							<bitRange>[30:30]</bitRange>
						</field>
						<field>
							<name>OVR_INT</name>
							<description>Overrun Interrupt flag. Any overrun bit in any of the
								individual channel data registers will cause this interrupt. In
								addition, if the MODE bit in either of the SEQn_CTRL registers is 0
								then the OVERRUN bit in the corresponding SEQn_GDAT register will
								also cause this interrupt. This interrupt must be enabled in the
								INTEN register. This bit will be cleared when all of the individual
								overrun bits have been cleared via reading the corresponding data
								registers.</description>
							<bitRange>[31:31]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>STARTUP</name>
					<description>ADC Startup Register (typically only used by the ADC
						API).</description>
					<addressOffset>0x6C</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ADC_ENA</name>
							<description>ADC Enable bit. This bit can only be set to a 1 by
								software. It is cleared automatically whenever the ADC is powered
								down. This bit must not be set until at least 10 microseconds after
								the ADC is powered up (typically by altering a system-level ADC
								power control bit).</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>ADC_INT</name>
							<description>tbd</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:2]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CALIB</name>
					<description>ADC Calibration Register.</description>
					<addressOffset>0x70</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CALIB</name>
							<description>Calibration request. Setting this bit will launch an ADC
								calibration cycle. This bit can only be set to a 1 by software. It
								is cleared automatically when the calibration cycle
								completes.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>CALREQD</name>
							<description>Calibration required. This read-only bit indicates if
								calibration is required when enabling the ADC. CALREQD will be 1 if
								no calibration has been run since the chip was powered-up and if the
								BYPASSCAL bit in the ADCTRL register is low. The ADC API will test
								this bit to determine whether to initiate a calibration cycle or
								whether to set the ADC_INIT bit (in the ADSTARTUP register) to
								launch the ADC initialization process which includes a dummy
								conversion cycle. Note: A dummy conversion cycle requires
								approximately 6 ADC clocks as opposed to 81 clocks required for
								calibration.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>CALVALUE</name>
							<description>Calibration Value. This read-only field displays the
								calibration value established during last calibration cycle. This
								value is not typically of any use to the user.</description>
							<bitRange>[8:2]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:9]</bitRange>
						</field>
					</fields>
				</register>
