ehughes/ESC-M4/CM4_TEST/PROJECTS/KEIL/INSTRUCTION_TEST/prj_xpresso54114/iar/support/LPC5411x.svd
						</field>
					</fields>
				</register>
				<register>
					<name>AHBCLKCTRL0</name>
					<description>AHB Clock control 0</description>
					<addressOffset>0x0C0</addressOffset>
					<access>read-write</access>
					<resetValue>0x1</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>ROM</name>
							<description>Enables the clock for the Boot ROM. 0 = Disable; 1 =
								Enable.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>SRAM1</name>
							<description>Enables the clock for SRAM1. 0 = Disable; 1 =
								Enable.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>SRAM2</name>
							<description>Enables the clock for SRAM2. 0 = Disable; 1 =
								Enable.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[6:5]</bitRange>
						</field>
						<field>
							<name>FLASH</name>
							<description>Enables the clock for the flash controller. 0 = Disable; 1
								= Enable.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>FMC</name>
							<description>Enables the clock for the Flash accelerator. 0 = Disable; 1
								= Enable.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[10:9]</bitRange>
						</field>
						<field>
							<name>INPUTMUX</name>
							<description>Enables the clock for the input muxes. 0 = Disable; 1 =
								Enable.</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>IOCON</name>
							<description>Enables the clock for the IOCON block. 0 = Disable; 1 =
								Enable.</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>GPIO0</name>
							<description>Enables the clock for the GPIO0 port registers. 0 =
								Disable; 1 = Enable.</description>
							<bitRange>[14:14]</bitRange>
						</field>
						<field>
							<name>GPIO1</name>
							<description>Enables the clock for the GPIO1 port registers. 0 =
								Disable; 1 = Enable.</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[17:16]</bitRange>
						</field>
						<field>
							<name>PINT</name>
							<description>Enables the clock for the pin interrupt block.0 = Disable;
								1 = Enable.</description>
							<bitRange>[18:18]</bitRange>
						</field>
						<field>
							<name>GINT</name>
							<description>Enables the clock for the grouped pin interrupt block. 0 =
								Disable; 1 = Enable.</description>
							<bitRange>[19:19]</bitRange>
						</field>
						<field>
							<name>DMA</name>
							<description>Enables the clock for the DMA controller. 0 = Disable; 1 =
								Enable.</description>
							<bitRange>[20:20]</bitRange>
						</field>
						<field>
							<name>CRC</name>
							<description>Enables the clock for the CRC engine. 0 = Disable; 1 =
								Enable.</description>
							<bitRange>[21:21]</bitRange>
						</field>
						<field>
							<name>WWDT</name>
							<description>Enables the clock for the Watchdog Timer. 0 = Disable; 1 =
								Enable.</description>
							<bitRange>[22:22]</bitRange>
						</field>
						<field>
							<name>RTC</name>
							<description>Enables the clock for the RTC. 0 = Disable; 1 =
								Enable.</description>
							<bitRange>[23:23]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[25:24]</bitRange>
						</field>
						<field>
							<name>MAILBOX</name>
							<description>Enables the clock for the Mailbox. 0 = Disable; 1 =
								Enable.</description>
							<bitRange>[26:26]</bitRange>
						</field>
						<field>
							<name>ADC0</name>
							<description>Enables the clock for the ADC0 register interface. 0 =
								Disable; 1 = Enable.</description>
							<bitRange>[27:27]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:28]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>AHBCLKCTRL1</name>
					<description>AHB Clock control 1</description>
					<addressOffset>0x0C4</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MRT</name>
							<description>Enables the clock for the Multi-Rate Timer. 0 = Disable; 1
								= Enable.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RIT</name>
							<description>Enables the clock for the repetitive interrupt timer. 0 =
								Disable; 1 = Enable.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>SCT0</name>
							<description>Enables the clock for SCT0. 0 = Disable; 1 =
								Enable.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[8:3]</bitRange>
						</field>
						<field>
							<name>FIFO</name>
							<description>Enables the clock for system FIFOs. 0 = Disable; 1 =
								Enable.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>UTICK</name>
							<description>Enables the clock for the Micro-tick Timer. 0 = Disable; 1
								= Enable.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[21:11]</bitRange>
						</field>
						<field>
							<name>TIMER2</name>
							<description>Enables the clock for Timer 2. 0 = Disable; 1 =
								Enable.</description>
							<bitRange>[22:22]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[25:23]</bitRange>
						</field>
						<field>
							<name>TIMER3</name>
							<description>Enables the clock for Timer 3. 0 = Disable; 1 =
								Enable.</description>
							<bitRange>[26:26]</bitRange>
						</field>
						<field>
							<name>TIMER4</name>
							<description>Enables the clock for Timer 4. 0 = Disable; 1 =
								Enable.</description>
							<bitRange>[27:27]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:28]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>AHBCLKCTRLSET0</name>
					<description>Set bits in AHBCLKCTRL0</description>
					<addressOffset>0x0C8</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>CLK_SET0</name>
							<description>Writing ones to this register sets the corresponding bit or
								bits in the AHBCLKCTRL0 register, if they are implemented. Bits that
								do not correspond to defined bits in AHBCLKCTRL0 are reserved and
								only zeroes should be written to them.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>AHBCLKCTRLSET1</name>
					<description>Set bits in AHBCLKCTRL1</description>
					<addressOffset>0x0CC</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>CLK_SET1</name>
							<description>Writing ones to this register sets the corresponding bit or
								bits in the AHBCLKCTRL1 register, if they are implemented. Bits that
								do not correspond to defined bits in AHBCLKCTRL1 are reserved and
								only zeroes should be written to them.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>AHBCLKCTRLCLR0</name>
					<description>Clear bits in AHBCLKCTRL0</description>
					<addressOffset>0x0D0</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>CLK_CLR0</name>
							<description>Writing ones to this register clears the corresponding bit
								or bits in the AHBCLKCTRL0 register, if they are implemented. Bits
								that do not correspond to defined bits in AHBCLKCTRL0 are reserved
								and only zeroes should be written to them.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>AHBCLKCTRLCLR1</name>
					<description>Clear bits in AHBCLKCTRL1</description>
					<addressOffset>0x0D4</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>CLK_CLR1</name>
							<description>Writing ones to this register clears the corresponding bit
								or bits in the AHBCLKCTRL1 register, if they are implemented. Bits
								that do not correspond to defined bits in AHBCLKCTRL1 are reserved
								and only zeroes should be written to them.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>SYSTICKCLKDIV</name>
					<description>SYSTICK clock divider</description>
					<addressOffset>0x0E0</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DIV</name>
							<description>SYSTICK clock divider value. 0: Disable SYSTICK timer
								clock. 1: Divide by 1. to 255: Divide by 255.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>AHBCLKDIV</name>
					<description>System clock divider</description>
					<addressOffset>0x100</addressOffset>
					<access>read-write</access>
					<resetValue>0x1</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DIV</name>
							<description>System AHB clock divider value. 0: System clock disabled.
								1: Divide by 1. to 255: Divide by 255.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>ADCCLKDIV</name>
					<description>ADC clock divider</description>
					<addressOffset>0x108</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DIV</name>
							<description>ADC clock divider value. 0: Disable ADC clock. 1: Divide by
								1. to 255: Divide by 255.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CLKOUTDIV</name>
					<description>CLKOUT clock divider</description>
					<addressOffset>0x10C</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DIV</name>
							<description>CLKOUT clock divider value. 0: Disable CLKOUT clock
								divider. 1: Divide by 1. to 255: Divide by 255.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>FREQMECTRL</name>
					<description>Frequency measure register</description>
					<addressOffset>0x120</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CAPVAL</name>
							<description>Stores the capture result which is used to calculate the
								frequency of the target clock. This field is
								read-only.</description>
							<bitRange>[13:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[30:14]</bitRange>
						</field>
						<field>
							<name>PROG</name>
							<description>Set this bit to one to initiate a frequency measurement
								cycle. Hardware clears this bit when the measurement cycle has
								completed and there is valid capture data in the CAPVAL field (bits
								13:0).</description>
							<bitRange>[31:31]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>FLASHCFG</name>
					<description>Flash wait states configuration</description>
					<addressOffset>0x124</addressOffset>
					<access>read-write</access>
					<resetValue>0x5000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not change the value of these bits. Bits 11:0
								must be written back exactly as read.</description>
							<bitRange>[11:0]</bitRange>

