ehughes/ESC-M4/CM4_TEST/PROJECTS/KEIL/INSTRUCTION_TEST/prj_xpresso54114/iar/support/LPC5411x.svd
						</field>
						<field>
							<name>FLASHTIM</name>
							<description>Flash memory access time. FLASHTIM +1 is equal to the
								number of system clocks used for flash access.</description>
							<bitRange>[14:12]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>1_CLOCK_CYCLE</name>
									<description>1 clock cycle. 1 system clock flash access time
										(for system clock frequencies of up to MHz).</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2_CLOCK_CYCLES</name>
									<description>2 clock cycles. 2 system clocks flash access time
										(for system clock frequencies of up to MHz).</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>3_CLOCK_CYCLES</name>
									<description>3 clock cycles. 3 system clocks flash access time
										(for system clock frequencies of up to MHz).</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4_CLOCK_CYCLES</name>
									<description>4 clock cycles. 4 system clocks flash access
										time.</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>5_CLOCK_CYCLES</name>
									<description>5 clock cycles. 5 system clocks flash access
										time.</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>6_CLOCK_CYCLES</name>
									<description>6 clock cycles. 6 system clocks flash access
										time.</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>7_CLOCK_CYCLES</name>
									<description>7 clock cycles. 7 system clocks flash access
										time.</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8_CLOCK_CYCLES</name>
									<description>8 clock cycles. 8 system clocks flash access
										time.</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not change the value of these bits. Bits 31:2
								must be written back exactly as read.</description>
							<bitRange>[31:15]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>FIFOCTRL</name>
					<description>Serial interface FIFO enables</description>
					<addressOffset>0x148</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>U0TXFIFOEN</name>
							<description>USART0 transmitter FIFO enable</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>U1TXFIFOEN</name>
							<description>USART1 transmitter FIFO enable</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>U2TXFIFOEN</name>
							<description>USART2 transmitter FIFO enable</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>U3TXFIFOEN</name>
							<description>USART3 transmitter FIFO enable</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>SPI0TXFIFOEN</name>
							<description>SPI0 transmitter FIFO enable</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>SPI1TXFIFOEN</name>
							<description>SPI1 transmitter FIFO enable</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>U0RXFIFOEN</name>
							<description>USART0 receiver FIFO enable</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>U1RXFIFOEN</name>
							<description>USART1 receiver FIFO enable</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>U2RXFIFOEN</name>
							<description>USART2 receiver FIFO enable</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>U3RXFIFOEN</name>
							<description>USART3 receiver FIFO enable</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>SPI0RXFIFOEN</name>
							<description>SPI0 receiver FIFO enable</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>SPI1RXFIFOEN</name>
							<description>SPI1 receiver FIFO enable</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:14]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>IRCCTRL</name>
					<description>IRC oscillator control</description>
					<addressOffset>0x184</addressOffset>
					<access>read-write</access>
					<resetValue>0x80</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TRIM</name>
							<description>Trim value</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RTCOSCCTRL</name>
					<description>RTC oscillator 32 kHz output control</description>
					<addressOffset>0x190</addressOffset>
					<access>read-write</access>
					<resetValue>0x1</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>EN</name>
							<description>RTC 32 kHz clock enable.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. RTC clock off.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. RTC clock on.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:1]</bitRange>

