ehughes/ESC-M4/CM4_TEST/PROJECTS/KEIL/INSTRUCTION_TEST/prj_xpresso54114/iar/support/LPC5411x.svd
				<register>
					<name>CPUCTRL</name>
					<description>CPU Control for multiple processors</description>
					<addressOffset>0x300</addressOffset>
					<access>read-write</access>
					<resetValue>0x4D</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MASTERCPU</name>
							<description>Determines which CPU is considered the master. The master
								CPU cannot have its clock turned off via the related CMnCLKEN bit or
								be reset via the related CMxRSTEN in this register. The slave CPU
								wakes up briefly following device reset, then goes back to sleep
								until activated by the master CPU.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>M0P</name>
									<description>M0+. Cortex-M0+ is the master CPU.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>M4</name>
									<description>M4. Cortex-M4 is the master CPU.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written..</description>
							<bitRange>[1:1]</bitRange>

						</field>
						<field>
							<name>CM4CLKEN</name>
							<description>Cortex-M4 clock enable.</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. The Cortex-M4 clock is not
										enabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. The Cortex-M4 clock is
										enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CM0CLKEN</name>
							<description>Cortex-M0+ clock enable.</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. The Cortex-M0+ clock is not
										enabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. The Cortex-M0+ clock is
										enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CM4RSTEN</name>
							<description>Cortex-M4 reset.</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. The Cortex-M4 is not being
										reset.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. The Cortex-M4 is being
										reset.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CM0RSTEN</name>
							<description>Cortex-M0+ reset.</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. The Cortex-M0+ is not being
										reset.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. The Cortex-M0+ is being
										reset.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>POWERCPU</name>
							<description>Identifies the owner of reduced power mode control: which
								CPU can cause the device to enter Sleep, Deep Sleep, Power-down, and
								Deep Power-down modes.</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>M0P</name>
									<description>M0+. Cortex-M0+ is the owner of reduced power mode
										control.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>M4</name>
									<description>M4. Cortex-M4 is the owner of reduced power mode
										control.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written..</description>
							<bitRange>[31:7]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>CPBOOT</name>
					<description>Coprocessor Boot Address</description>
					<addressOffset>0x304</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>BOOTADDR</name>
							<description>Slave processor boot address.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CPSTACK</name>
					<description>Coprocessor Stack Address</description>
					<addressOffset>0x308</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>STACKADDR</name>
							<description>Slave processor stack address.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>JTAGIDCODE</name>
					<description>JTAG ID code register</description>
					<addressOffset>0x3F4</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>JTAGID</name>
							<description>JTAG ID code.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>DEVICE_ID0</name>
					<description>Part ID register</description>
					<addressOffset>0x3F8</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>PARTID</name>
							<description>Part ID</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>DEVICE_ID1</name>
					<description>Boot ROM and die revision register</description>
					<addressOffset>0x3FC</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>REVID</name>
							<description>Revision.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>













