ehughes/ESC-M4/CM4_TEST/PROJECTS/KEIL/INSTRUCTION_TEST/prj_xpresso54114/iar/support/LPC5411x.svd
						</field>
					</fields>
				</register>
				<register>
					<name>CTCR</name>
					<description>Count Control Register. The CTCR selects between Timer and Counter
						mode, and in Counter mode selects the signal and edge(s) for
						counting.</description>
					<addressOffset>0x70</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CTMODE</name>
							<description>Counter/Timer Mode This field selects which rising PCLK
								edges can increment Timer's Prescale Counter (PC), or clear PC and
								increment Timer Counter (TC). Timer Mode: the TC is incremented when
								the Prescale Counter matches the Prescale Register.</description>
							<bitRange>[1:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>TIMER_MODE</name>
									<description>Timer Mode. Incremented every rising PCLK
										edge.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COUNTER_MODE_RISING</name>
									<description>Counter Mode rising edge. TC is incremented on
										rising edges on the CAP input selected by bits
										3:2.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COUNTER_MODE_FALLING</name>
									<description>Counter Mode falling edge. TC is incremented on
										falling edges on the CAP input selected by bits
										3:2.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COUNTER_MODE_DUAL_ED</name>
									<description>Counter Mode dual edge. TC is incremented on both
										edges on the CAP input selected by bits 3:2.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CINSEL</name>
							<description>Count Input Select When bits 1:0 in this register are not
								00, these bits select which CAP pin is sampled for clocking. Note:
								If Counter mode is selected for a particular CAPn input in the CTCR,
								the 3 bits for that input in the Capture Control Register (CCR) must
								be programmed as 000. However, capture and/or interrupt can be
								selected for the other 3 CAPn inputs in the same
								timer.</description>
							<bitRange>[3:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>CHANNEL_0</name>
									<description>Channel 0. CAPn.0 for TIMERn</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CHANNEL_1</name>
									<description>Channel 1. CAPn.1 for TIMERn</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CHANNEL_2</name>
									<description>Channel 2. CAPn.2 for TIMERn</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CHANNEL_3</name>
									<description>Channel 3. CAPn.3 for TIMERn</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ENCC</name>
							<description>Setting this bit to 1 enables clearing of the timer and the
								prescaler when the capture-edge event specified in bits 7:5
								occurs.</description>
							<bitRange>[4:4]</bitRange>

						</field>
						<field>
							<name>SELCC</name>
							<description>Edge select. When bit 4 is 1, these bits select which
								capture input edge will cause the timer and prescaler to be cleared.
								These bits have no effect when bit 4 is low. Values 0x2 to 0x3 and
								0x6 to 0x7 are reserved.</description>
							<bitRange>[7:5]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>CHANNEL_0_RISING_EDG</name>
									<description>Channel 0 Rising Edge. Rising edge of the signal on
										capture channel 0 clears the timer (if bit 4 is
										set).</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CHANNEL_0_FALLING_ED</name>
									<description>Channel 0 Falling Edge. Falling edge of the signal
										on capture channel 0 clears the timer (if bit 4 is
										set).</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CHANNEL_1_RISING_EDG</name>
									<description>Channel 1 Rising Edge. Rising edge of the signal on
										capture channel 1 clears the timer (if bit 4 is
										set).</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CHANNEL_1_FALLING_ED</name>
									<description>Channel 1 Falling Edge. Falling edge of the signal
										on capture channel 1 clears the timer (if bit 4 is
										set).</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CHANNEL_2_RISING_EDG</name>
									<description>Channel 2 Rising Edge. Rising edge of the signal on
										capture channel 2 clears the timer (if bit 4 is
										set).</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CHANNEL_2_FALLING_ED</name>
									<description>Channel 2 Falling Edge. Falling edge of the signal
										on capture channel 2 clears the timer (if bit 4 is
										set).</description>
									<value>0x5</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:8]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>PWMC</name>
					<description>PWM Control Register. The PWMCON enables PWM mode for the external
						match pins.</description>
					<addressOffset>0x74</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PWMEN0</name>
							<description>PWM mode enable for channel0.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>MATCH</name>
									<description>Match. CT32Bn_MAT0 is controlled by
										EM0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PWM</name>
									<description>PWM. PWM mode is enabled for
										CT32Bn_MAT0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWMEN1</name>
							<description>PWM mode enable for channel1.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>MATCH</name>
									<description>Match. CT32Bn_MAT01 is controlled by
										EM1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PWM</name>
									<description>PWM. PWM mode is enabled for
										CT32Bn_MAT1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWMEN2</name>
							<description>PWM mode enable for channel2.</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>MATCH</name>
									<description>Match. CT32Bn_MAT2 is controlled by
										EM2.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PWM</name>
									<description>PWM. PWM mode is enabled for
										CT32Bn_MAT2.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWMEN3</name>
							<description>PWM mode enable for channel3. Note: It is recommended to
								use match channel 3 to set the PWM cycle.</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>MATCH</name>
									<description>Match. CT32Bn_MAT3 is controlled by
										EM3.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PWM</name>
									<description>PWM. PWM mode is enabled for
										CT132Bn_MAT3.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:4]</bitRange>

