ehughes/ESC-M4/CM4_TEST/PROJECTS/KEIL/INSTRUCTION_TEST/prj_xpresso54114/iar/support/LPC5411x.svd
						</field>
						<field>
							<name>INVERT</name>
							<description>Input polarity.</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. Input function is not
										inverted.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. Input is function inverted.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DIGIMODE</name>
							<description>Select Analog/Digital mode.</description>
							<bitRange>[7:7]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ANALOG_MODE</name>
									<description>Analog mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIGITAL_MODE</name>
									<description>Digital mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FILTEROFF</name>
							<description>Controls input glitch filter.</description>
							<bitRange>[8:8]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>FILTER_ENABLED</name>
									<description>Filter enabled. Noise pulses below approximately 10
										ns are filtered out</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FILTER_DISABLED</name>
									<description>Filter disabled. No input filtering is
										done</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SLEW</name>
							<description>Driver slew rate.</description>
							<bitRange>[9:9]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>STANDARD_MODE</name>
									<description>Standard mode, output slew rate control is enabled.
										More outputs can be switched simultaneously.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FAST_MODE</name>
									<description>Fast mode, slew rate control is disabled. Refer to
										the appropriate specific device data sheet for
										details.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OD</name>
							<description>Controls open-drain mode.</description>
							<bitRange>[10:10]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. Normal push-pull output</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. Simulated open-drain output (high drive
										disabled)</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:11]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<dim>6</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>23-28</dimIndex>
					<name>PIO0_%s</name>
					<description>Digital I/O control for port 0 pins PIO0_23 to PIO0_28. These pins
						support I2C with true open-drain, drive and filtering for modes up to
						Fast-mode Plus.</description>
					<addressOffset>0x05C</addressOffset>
					<access>read-write</access>
					<resetValue>0x000001A0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FUNC</name>
							<description>Selects pin function.</description>
							<bitRange>[2:0]</bitRange>

						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[4:3]</bitRange>

						</field>
						<field>
							<name>I2CSLEW</name>
							<description>Controls slew rate of I2C pad.</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>I2C_MODE</name>
									<description>I2C mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GPIO_MODE</name>
									<description>GPIO mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INVERT</name>
							<description>Input polarity.</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. Input function is not
										inverted.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. Input is function inverted.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DIGIMODE</name>
							<description>Select Analog/Digital mode.</description>
							<bitRange>[7:7]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ANALOG_MODE</name>
									<description>Analog mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIGITAL_MODE</name>
									<description>Digital mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FILTEROFF</name>
							<description>Controls input glitch filter.</description>
							<bitRange>[8:8]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>FILTER_ENABLED</name>
									<description>Filter enabled. Noise pulses below approximately 10
										ns are filtered out</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FILTER_DISABLED</name>
									<description>Filter disabled. No input filtering is
										done</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>I2CDRIVE</name>
							<description>Controls the current sink capability of the
								pin.</description>
							<bitRange>[9:9]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>LOW_DRIVE</name>
									<description>Low drive. Output drive sink is 4 mA. This is
										sufficient for standard and fast mode I2C.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH_DRIVE</name>
									<description>High drive. Output drive sink is 20 mA. This is
										needed for Fast Mode Plus I 2C. Refer to the appropriate
										specific device data sheet for details.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>I2CFILTER</name>
							<description>Configures I2C features for standard mode, fast mode, and
								Fast Mode Plus operation.</description>
							<bitRange>[10:10]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. I2C 50 ns glitch filter
										enabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. I2C 50 ns glitch filter
										disabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:11]</bitRange>

