ehughes/ESC-M4/CM4_TEST/PROJECTS/KEIL/INSTRUCTION_TEST/prj_xpresso54114/iar/support/LPC5411x.svd
						</field>
					</fields>
				</register>
				<register>
					<name>MATCH</name>
					<description>RTC match register</description>
					<addressOffset>0x004</addressOffset>
					<access>read-write</access>
					<resetValue>0xFFFF</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MATVAL</name>
							<description>Contains the match value against which the 1 Hz RTC timer
								will be compared to generate set the alarm flag RTC_ALARM and
								generate an alarm interrupt/wake-up if enabled.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>COUNT</name>
					<description>RTC counter register</description>
					<addressOffset>0x008</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>VAL</name>
							<description>A read reflects the current value of the main, 1 Hz RTC
								timer. A write loads a new initial value into the timer. The RTC
								counter will count up continuously at a 1 Hz rate once the RTC
								Software Reset is removed (by clearing bit 0 of the CTRL register).
								Only write to this register when the RTC_EN bit in the RTC CTRL
								Register is 0. The counter increments one second after the RTC_EN
								bit is set.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>WAKE</name>
					<description>RTC high-resolution/wake-up timer control register</description>
					<addressOffset>0x00C</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>VAL</name>
							<description>A read reflects the current value of the
								high-resolution/wake-up timer. A write pre-loads a start count value
								into the wake-up timer and initializes a count-down sequence. Do not
								write to this register while counting is in progress.</description>
							<bitRange>[15:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written..</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>

		<peripheral>
			<name>INPUTMUX</name>
			<description>Input multiplexing</description>
			<groupName>INPUTMUX</groupName>
			<baseAddress>0x40005000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<dim>6</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-5</dimIndex>
					<name>SCT0_INMUX%s</name>
					<description>Input mux register for SCT0 input 0</description>
					<addressOffset>0x000</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>INP_N</name>
							<description>Input number (decimal value) to SCT0 inputs 0 to 5. 0 =
								PIO0_23 (external pin) 1 = PIO0_24 (external pin) 2 = PIO0_25
								(external pin) 3 = PIO0_26 (external pin) 4 = PIO0_27 (external pin)
								5 = PIO0_28 (external pin) 6 = ADC0_THCMP_IRQ (ADC0 threshold
								compare interrupt) 7 = DEBUG_HALTED (from ARM Cortex CoreSight
								Debugger)</description>
							<bitRange>[4:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:5]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>8</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-7</dimIndex>
					<name>PINTSEL%s</name>
					<description>Pin interrupt select register 0</description>
					<addressOffset>0x0C0</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>INTPIN</name>
							<description>Pin number select for pin interrupt or pattern match engine
								input. (PIO0_0 to PIO1_31 correspond to numbers 0 to
								63).</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>22</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-21</dimIndex>
					<name>DMA_ITRIG_INMUX%s</name>
					<description>Trigger select register for DMA channel 0</description>
					<addressOffset>0x0E0</addressOffset>
					<access>read-write</access>
					<resetValue>0x1F</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>INP</name>
							<description>Trigger input number (decimal value) for DMA channel n (n =
								0 to 21). 0 = ADC0 Sequence A interrupt 1 = ADC0 Sequence B
								interrupt 2 = SCT0 DMA request 0 3 = SCT0 DMA request 1 4 = Timer 0
								Match 0 5 = Timer 0 Match 1 6 = Timer 1 Match 0 7 = Timer 2 Match 0
								8 = Timer 2 Match 1 9 = Timer 3 Match 0 10 = Timer 4 Match 0 11 =
								Timer 4 Match 1 12 = Pin interrupt 0 13 = Pin interrupt 1 14 = Pin
								interrupt 2 15 = Pin interrupt 3 16 = DMA output trigger mux 0 17 =
								DMA output trigger mux 1 18 = DMA output trigger mux 2 19 = DMA
								output trigger mux 3</description>
							<bitRange>[4:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:5]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>4</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-3</dimIndex>
					<name>DMA_OTRIG_INMUX%s</name>
					<description>DMA output trigger selection to become DMA trigger 16</description>
					<addressOffset>0x140</addressOffset>
					<access>read-write</access>
					<resetValue>0x1F</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>INP</name>
							<description>DMA trigger output number (decimal value) for DMA channel n
								(n = 0 to 19).</description>
							<bitRange>[4:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:5]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>FREQMEAS_REF</name>
					<description>Clock selection for frequency measurement function reference
						clock</description>
					<addressOffset>0x160</addressOffset>
					<access>read-write</access>
					<resetValue>0x1F</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CLKIN</name>
							<description>Clock source number (decimal value) for frequency measure
								function target clock: 0 = System oscillator (MAIN_OSC) 1 = IRC
								oscillator 2 = Watchdog oscillator 3 = 32 kHz RTC oscillator 4 =
								Main clock (see Section 4.5.21) 5 = PIO0_4 6 = PIO0_20 7 = PIO0_24 8
								= PIO1_4</description>
							<bitRange>[4:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:5]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>FREQMEAS_TARGET</name>
					<description>Clock selection for frequency measurement function target
						clock</description>
					<addressOffset>0x164</addressOffset>
					<access>read-write</access>
					<resetValue>0x1F</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CLKIN</name>
							<description>Clock source number (decimal value) for frequency measure
								function target clock: 0 = System oscillator (MAIN_OSC) 1 = IRC
								oscillator 2 = Watchdog oscillator 3 = 32 kHz RTC oscillator 4 =
								Main clock (see Section 4.5.18) 5 = PIO0_4 6 = PIO0_20 7 = PIO0_24 8
								= PIO1_4</description>
							<bitRange>[4:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:5]</bitRange>
						</field>
					</fields>
				</register>
