ehughes/ESC-M4/CM4_TEST/PROJECTS/KEIL/INSTRUCTION_TEST/prj_xpresso54114/iar/support/LPC5411x.svd
						</field>
						<field>
							<name>SYNCMST</name>
							<description>Synchronous mode Master select.</description>
							<bitRange>[14:14]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>SLAVE</name>
									<description>Slave. When synchronous mode is enabled, the USART
										is a slave.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MASTER</name>
									<description>Master. When synchronous mode is enabled, the USART
										is a master.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LOOP</name>
							<description>Selects data loopback mode.</description>
							<bitRange>[15:15]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL_OPERATION</name>
									<description>Normal operation.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOOPBACK_MODE</name>
									<description>Loopback mode. This provides a mechanism to perform
										diagnostic loopback testing for USART data. Serial data from
										the transmitter (Un_TXD) is connected internally to serial
										input of the receive (Un_RXD). Un_TXD and Un_RTS activity
										will also appear on external pins if these functions are
										configured to appear on device pins. The receiver RTS signal
										is also looped back to CTS and performs flow control if
										enabled by CTSEN.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IOMODE</name>
							<description>I/O output mode.</description>
							<bitRange>[16:16]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>STANDARD</name>
									<description>Standard. USART output and input operate in
										standard fashion.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>IRDA</name>
									<description>IrDA. USART output and input operate in IrDA
										mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[17:17]</bitRange>

						</field>
						<field>
							<name>OETA</name>
							<description>Output Enable Turnaround time enable for RS-485
								operation.</description>
							<bitRange>[18:18]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. If selected by OESEL, the Output Enable
										signal deasserted at the end of the last stop bit of a
										transmission.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. If selected by OESEL, the Output Enable
										signal remains asserted for one character time after the end
										of the last stop bit of a transmission. OE will also remain
										asserted if another transmit begins before it is
										deasserted.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>AUTOADDR</name>
							<description>Automatic Address matching enable.</description>
							<bitRange>[19:19]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. When addressing is enabled by ADDRDET,
										address matching is done by software. This provides the
										possibility of versatile addressing (e.g. respond to more
										than one address).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. When addressing is enabled by ADDRDET,
										address matching is done by hardware, using the value in the
										ADDR register as the address to match.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OESEL</name>
							<description>Output Enable Select.</description>
							<bitRange>[20:20]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>STANDARD</name>
									<description>Standard. The RTS signal is used as the standard
										flow control function.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RS_485</name>
									<description>RS-485. The RTS signal configured to provide an
										output enable signal to control an RS-485
										transceiver.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OEPOL</name>
							<description>Output Enable Polarity.</description>
							<bitRange>[21:21]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>LOW</name>
									<description>Low. If selected by OESEL, the output enable is
										active low.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>High. If selected by OESEL, the output enable is
										active high.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RXPOL</name>
							<description>Receive data polarity.</description>
							<bitRange>[22:22]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>STANDARD</name>
									<description>Standard. The RX signal is used as it arrives from
										the pin. This means that the RX rest value is 1, start bit
										is 0, data is not inverted, and the stop bit is
										1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INVERTED</name>
									<description>Inverted. The RX signal is inverted before being
										used by the USART. This means that the RX rest value is 0,
										start bit is 1, data is inverted, and the stop bit is
										0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TXPOL</name>
							<description>Transmit data polarity.</description>
							<bitRange>[23:23]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>STANDARD</name>
									<description>Standard. The TX signal is sent out without change.
										This means that the TX rest value is 1, start bit is 0, data
										is not inverted, and the stop bit is 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INVERTED</name>
									<description>Inverted. The TX signal is inverted by the USART
										before being sent out. This means that the TX rest value is
										0, start bit is 1, data is inverted, and the stop bit is
										0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:24]</bitRange>

