ehughes/ESC-M4/CM4_TEST/PROJECTS/KEIL/INSTRUCTION_TEST/prj_xpresso54114/iar/support/LPC5411x.svd
				<register>
					<name>ADDR</name>
					<description>Address register for automatic address matching.</description>
					<addressOffset>0x2C</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ADDRESS</name>
							<description>8-bit address used with automatic address matching. Used
								when address detection is enabled (ADDRDET in CTL = 1) and automatic
								address matching is enabled (AUTOADDR in CFG = 1).</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, the value read from a reserved bit is not
								defined.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
			</registers>






		</peripheral>
		<peripheral derivedFrom="USART0">
			<name>USART1</name>
			<description>USART1</description>
			<baseAddress>0x40088000</baseAddress>

			<addressBlock>
				<offset>0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>UART1</name>
				<value>18</value>
			</interrupt>

		</peripheral>
		<peripheral derivedFrom="USART0">
			<name>USART2</name>
			<description>USART2</description>
			<baseAddress>0x4008C000</baseAddress>

			<addressBlock>
				<offset>0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>UART2</name>
				<value>19</value>
			</interrupt>

		</peripheral>
		<peripheral derivedFrom="USART0">
			<name>USART3</name>
			<description>USART3</description>
			<baseAddress>0x40090000</baseAddress>

			<addressBlock>
				<offset>0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>UART3</name>
				<value>20</value>
			</interrupt>

		</peripheral>
		<peripheral>
			<name>I2C0</name>
			<description>I2C-bus interface 0</description>
			<groupName>I2C0</groupName>
			<baseAddress>0x40094000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>I2C0</name>
				<value>21</value>
			</interrupt>
			<registers>
				<register>
					<name>CFG</name>
					<description>Configuration for shared functions.</description>
					<addressOffset>0x00</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MSTEN</name>
							<description>Master Enable. When disabled, configurations settings for
								the Master function are not changed, but the Master function is
								internally reset.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. The I2C Master function is
										disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. The I2C Master function is
										enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SLVEN</name>
							<description>Slave Enable. When disabled, configurations settings for
								the Slave function are not changed, but the Slave function is
								internally reset.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. The I2C slave function is
										disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. The I2C slave function is
										enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MONEN</name>
							<description>Monitor Enable. When disabled, configurations settings for
								the Monitor function are not changed, but the Monitor function is
								internally reset.</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. The I2C monitor function is
										disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. The I2C monitor function is
										enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TIMEOUTEN</name>
							<description>I2C bus Time-out Enable. When disabled, the time-out
								function is internally reset.</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. Time-out function is
										disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. Time-out function is enabled. Both types
										of time-out flags will be generated and will cause
										interrupts if they are enabled. Typically, only one time-out
										will be used in a system.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MONCLKSTR</name>
							<description>Monitor function Clock Stretching.</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. The monitor function will not perform
										clock stretching. Software or DMA may not always be able to
										read data provided by the monitor function before it is
										overwritten. This mode may be used when non-invasive
										monitoring is critical.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. The monitor function will perform clock
										stretching in order to ensure that software or DMA can read
										all incoming data supplied by the monitor
										function.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HSCAPABLE</name>
							<description>High-speed mode Capable enable. Since High Speed mode
								alters the way I2C pins drive and filter, as well as the timing for
								certain I2C signalling, enabling High-speed mode applies to all
								functions: master, slave, and monitor.</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>FAST_MODE_PLUS</name>
									<description>Fast-mode plus. The I2C block will support
										Standard-mode, Fast-mode, and Fast-mode Plus, to the extent
										that the pin electronics support these modes. Any changes
										that need to be made to the pin controls, such as changing
										the drive strength or filtering, must be made by software
										via the IOCON register associated with each I2C
										pin,</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH_SPEED</name>
									<description>High-speed. In addition to Standard-mode,
										Fast-mode, and Fast-mode Plus, the I 2C block will support
										High-speed mode to the extent that the pin electronics
										support these modes. See Section 23.7.1.2 for more
										information.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:6]</bitRange>

